In [1]:
# Merge and join are basically same , which combines the different dataframes Horizontally 
# concat which combines the different dataframes vertically based on same column

In [2]:
import pandas as pd

In [ ]:
# concat only take list []-- pd.concat([df1,df2]) -- horizontally, axis = 0 - rows
# pd.concat([df1,df2],axis=1) -- Vertically , axis =1 - column 
# if we have more than 2 table , it better to assign in value tehn cancat 
# f=[df1,df2,df3]
# pf.concat(f)

In [3]:
# append used to concatenate of dataframes
# valriable = df1.append(df2)

### Merge and Joins

# cross product can be done with help of merge 
def cartesian_product_basic(left,right):
    return(
    left.assign(key=1).merge(right.assign(key=1),on='key').drop('key',1))

In [2]:
import pandas as pd

In [1]:
# we can fill the null value in the dataframe using backfill, frontfill, mean(), 0 , in case of string max occurance 
# df.fillna(method='bfill'), df.fillna(method='ffill'), df.fillns(df.mean()),df.fillna(0)
# we can drop the null value from dataframe using df.dropna(axis=1)

In [10]:
import pandas as pd

In [11]:
emp=pd.DataFrame({'name':['a','b','c'],
             'salary':[12000,22000,35000]})

In [12]:
emp

  name  salary
0    a   12000
1    b   22000
2    c   35000

In [13]:
grade=pd.DataFrame({'Grades':['I','II','III'],
            'lower_limit':[10000,20000,30000],
            'upper_limit':[15000,25000,35000]})

In [15]:
grade

  Grades  lower_limit  upper_limit
0      I        10000        15000
1     II        20000        25000
2    III        30000        35000

  Grades  lower_limit  upper_limit
0      I        10000        15000
1     II        20000        25000
2    III        30000        35000

In [17]:
full=pd.concat([emp,grade],axis=1)

In [18]:
full

  name  salary Grades  lower_limit  upper_limit
0    a   12000      I        10000        15000
1    b   22000     II        20000        25000
2    c   35000    III        30000        35000

In [24]:
full["salary"].between(full["lower_limit"],full["upper_limit"],inclusive=True)

0    True
1    True
2    True
dtype: bool

In [2]:
string ="Hello world"
lst_str = list(string)
lst_str[1]='a'
print(lst_str)

['H', 'a', 'l', 'l', 'o', ' ', 'w', 'o', 'r', 'l', 'd']

In [8]:
s="".join(lst_str)
print(s)

Hallo world